hasinthainduwara/test_esp/sdkconfig.defaults
# ESP32-S3-CAM (N16R8: 16MB flash, 8MB OPI PSRAM)
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_40M=y

CONFIG_ESP_HTTP_SERVER_MAX_URI_HANDLERS=8
CONFIG_HTTPD_WS_SUPPORT=y

CONFIG_ROBOT_WIFI_MODE_AP=y
CONFIG_ROBOT_WIFI_AP_SSID="Robot-Camera"
CONFIG_ROBOT_WIFI_AP_PASSWORD="12345678"
CONFIG_ROBOT_WIFI_AP_CHANNEL=6
CONFIG_ROBOT_WIFI_AP_MAX_CONN=4

# UART gateway to ESP32 slave (GPIO1/2 — do NOT use 43/44 USB console pins)
CONFIG_MASTER_UART_PORT=1
CONFIG_MASTER_UART_TX_GPIO=1
CONFIG_MASTER_UART_RX_GPIO=2
CONFIG_MASTER_UART_BAUD=115200

# BTS7960 on Freenove ESP32-S3 right-side headers (not camera / PSRAM / USB)
CONFIG_MOTOR_ENABLE=y
CONFIG_MOTOR_PWM_DUTY=200
CONFIG_MOTOR_LEFT_RPWM_GPIO=39
CONFIG_MOTOR_LEFT_LPWM_GPIO=40
CONFIG_MOTOR_LEFT_R_EN_GPIO=41
CONFIG_MOTOR_LEFT_L_EN_GPIO=42
CONFIG_MOTOR_RIGHT_RPWM_GPIO=47
CONFIG_MOTOR_RIGHT_LPWM_GPIO=48
CONFIG_MOTOR_RIGHT_R_EN_GPIO=21
# GPIO20 is USB_D+ on ESP32-S3 — do not use for motor enable, use 45 instead.
CONFIG_MOTOR_RIGHT_L_EN_GPIO=45
# GPIO19 is USB_D- on ESP32-S3 — do not use, use GPIO0 instead.
CONFIG_MOTOR_LED_GPIO=0
